{"config": [{"config": {"batch_input_shape": [null, 1, 24, 32], "bias_regularizer": null, "data_format": "channels_first", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "name": "conv2d_9", "activation": "relu", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "momentum": 0.99, "beta_constraint": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "zero_padding2d_9", "data_format": "channels_first", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "data_format": "channels_first", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "name": "conv2d_10", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.25, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "zero_padding2d_10", "data_format": "channels_first", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_7", "data_format": "channels_first", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "data_format": "channels_first", "filters": 16, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "name": "conv2d_11", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_11", "data_format": "channels_first", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_8", "data_format": "channels_first", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "data_format": "channels_first", "filters": 16, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "name": "conv2d_12", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_12", "data_format": "channels_first", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_9", "data_format": "channels_first", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "units": 16, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "units": 3, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}