{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "name": "conv2d_13", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 1, 24, 32], "data_format": "channels_first", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_13", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "name": "conv2d_14", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_6", "rate": 0.25, "seed": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_14", "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_10", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "name": "conv2d_15", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_15", "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_11", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "name": "conv2d_16", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_16", "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_12", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "activation": "relu", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 16, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_7", "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "activation": "softmax", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 3, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null}}]}