{"config": [{"config": {"activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 24, 32], "name": "conv2d_21", "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "data_format": "channels_first", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_first", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_21"}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_22", "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_first", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "name": "dropout_13", "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_first", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_22"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_11", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_23", "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 16, "data_format": "channels_first", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_23"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_12", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_24", "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 16, "data_format": "channels_first", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_24"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_13", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "units": 16, "name": "dense_13", "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_14", "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "units": 3, "name": "dense_14", "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}